hw3/report.tex
% Created 2021-04-23 Fri 01:14
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\documentclass{article}
\usepackage{here}
\usepackage{xcolor}
\usepackage[margin=3.0cm]{geometry}
\usepackage{amsmath}
\usepackage{parskip}
\renewcommand\arraystretch{1.4}
\usepackage[margin=1in]{geometry}
\usepackage{minted}
\definecolor{bg}{rgb}{0.95,0.95,0.95}
\newminted{c}{frame=single}
\author{Fatih Kaan Salgır - 171044009}
\date{}
\title{CSE344 - System Programming - Homework \#2}
\hypersetup{
 pdfauthor={Fatih Kaan Salgır - 171044009},
 pdftitle={CSE344 - System Programming - Homework \#2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.5)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Design Explanation}
\label{sec:orgb6045d4}

\begin{enumerate}
\item First process will create the shared memory, and all of them are going open it.
\item The process will create the fifo. This fifo will be the fifo that the process reads. If the process has a potato, it will register to shared memory with the pid. And wait for creation of all fifos.
\item All of the fifos are going to be opened. 1 one of them to read, other ones to write.
\item If process has a potato it will write its pid to a random fifo.
\item The process will read its fifo until it reads either a potato id or a termination message (integer, defined as -2) when all potatoes are cooled down.
\item It will gets the potato with potato id, increments its number of switch, checks if cooled down. If its the case, it will let others know and terminate. Otherwise it will write again to some random fifo.
\end{enumerate}

\noindent\rule{\textwidth}{0.5pt}

\begin{itemize}
\item Maximum number of fifo to handle is defined as \texttt{N} (64).
\item Shared memory size defined as \texttt{SHM\_SIZE} (1024).
\end{itemize}


\subsection{Shared Memory Initilization}
\label{sec:org6d0c5c0}
First \texttt{shm\_open} is called with both \texttt{O\_CREAT} and \texttt{O\_EXCL} flags. As the man page of the \texttt{shm\_open} states, if the shared memory already exist, it will return -1 and \texttt{errno} will set to \texttt{EEXIST}. 
If shared memory already exists then, simply \texttt{mmap} can be used to establist the mapping address.
If shared memory is created, some initialization steps needed:
\begin{itemize}
\item \texttt{ftruncate} will be called to set its size.
\item Semaphore in the shared memory will be set to 0.
\item number of created files will be set to 0.
\item number of potatoes will be set to 0.
\end{itemize}
Shared memory initialization is protected by using named semaphore.

\newpage
\subsection{Shared Memory Design}
\label{sec:org3550aa2}
\texttt{struct shared\_memory} is used in order to organize shared memory.

\begin{center}
\ttfamily{}
\begin{tabular}{l|l}
all fifos are created & [sem \_t]\\
\hline
number of created fifos & [int]\\
\hline
size of potatoes & [int]\\
\hline
\#1 potato & [struct\{int, int, int\}]\\
\quad \#1 id & [int]\\
\quad \#1 switch count & [int]\\
\quad \#1 number of switches & [int]\\
\hline
\#2 potato & [struct\{int, int, int\}]\\
\quad \#2 id & [int]\\
\quad \#2 switch count & [int]\\
\quad \#2 number of switches & [int]\\
\hline
\ldots{} & \\
\end{tabular}
\end{center}

\subsection{Waiting for FIFO Creation}
\label{sec:org1c542d8}
\begin{enumerate}
\item A process is going to create their fifo and wait for other process using \texttt{sem\_wait()}. This semaphore is different from the one given as command-line arguement. It lies in the shared memory, and inital value is 0. (\texttt{all\_fifos\_created})
\item Processes will create the fifos one by one, to avoid race condition. The synchronization technique is used here is named semaphore.
\item If a process has been reached to \texttt{EOF}, so this process is the last one. This means all other processes are ready to continue. It will increment to value of \texttt{sem\_post()} N times (number of processes).
\end{enumerate}

\subsection{Handling SIGINT}
\label{sec:org54c10ae}
In case of receiving \texttt{SIGINT}, processs will stop switching potatoes. Let the others know that it has received \texttt{SIGINT} via fifo. As a result all processes will be terminated. And give all the resources (shared memory, semaphore, open files) back to the system.
If a process receives \texttt{SIGINT} before it has a chance to open the fifos, in this case it simply exits.
\newpage
\section{Running \& Test Cases}
\label{sec:org5fe5513}

Program tested with different cases and also with the valgrind to check memory leaks. According the output of the valgrind, "All heap blocks were freed -- no leaks are possible".

\begin{minted}[fontsize=\small,frame=single,framesep=3mm]{text}
valgrind --leak-check=full \
         --show-leak-kinds=all \
         --track-origins=yes \
         --verbose \
         --log-file=valgrind-out.txt \
         ...
\end{minted}


Running with 4 processes and 3 potatoes:

\begin{minted}[fontsize=\small,frame=single,framesep=3mm]{text}
./player -b 5 -f fifonames -m s1 -s sharedmem &
./player -b 0 -f fifonames -m s1 -s sharedmem &
./player -b 8 -f fifonames -m s1 -s sharedmem &
./player -b 3 -f fifonames -m s1 -s sharedmem &
\end{minted}

\begin{minted}[fontsize=\small,frame=single,framesep=3mm]{text}
pid=2726573 sending potato number 2726573 to fifos/fifo3; this is switch number 1 / 3
pid=2726572 sending potato number 2726572 to fifos/fifo4; this is switch number 1 / 8
pid=2726572 receiving potato number 2726573 from fifos/fifo3
pid=2726572 sending potato number 2726573 to fifos/fifo2; this is switch number 2 / 3
pid=2726570 sending potato number 2726570 to fifos/fifo3; this is switch number 1 / 5
pid=2726572 receiving potato number 2726570 from fifos/fifo3
pid=2726572 sending potato number 2726570 to fifos/fifo4; this is switch number 2 / 5
pid=2726571; potato number 2726573 has cooled down
pid=2726573 receiving potato number 2726572 from fifos/fifo4
pid=2726573 sending potato number 2726572 to fifos/fifo2; this is switch number 2 / 8
pid=2726573 receiving potato number 2726570 from fifos/fifo4
pid=2726573 sending potato number 2726570 to fifos/fifo1; this is switch number 3 / 5
pid=2726571 receiving potato number 2726572 from fifos/fifo2
pid=2726571 sending potato number 2726572 to fifos/fifo3; this is switch number 3 / 8
pid=2726572 receiving potato number 2726572 from fifos/fifo3
pid=2726572 sending potato number 2726572 to fifos/fifo4; this is switch number 4 / 8
pid=2726573 receiving potato number 2726572 from fifos/fifo4
pid=2726573 sending potato number 2726572 to fifos/fifo3; this is switch number 5 / 8
pid=2726572 receiving potato number 2726572 from fifos/fifo3
pid=2726572 sending potato number 2726572 to fifos/fifo4; this is switch number 6 / 8
pid=2726573 receiving potato number 2726572 from fifos/fifo4
pid=2726573 sending potato number 2726572 to fifos/fifo1; this is switch number 7 / 8
pid=2726570 receiving potato number 2726570 from fifos/fifo1
pid=2726570 sending potato number 2726570 to fifos/fifo2; this is switch number 4 / 5
pid=2726570; potato number 2726572 has cooled down
pid=2726571; potato number 2726570 has cooled down
\end{minted}
\end{document}